app/views/restaurants/show.html.erb

            <tbody>
                <% @restaurant.foods.each do |food| %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."restaurant_id" = ?  [["restaurant_id", 1]]


             <% @restaurant.restaurant_reviews.each do |review| %>
---
SELECT "restaurant_reviews".* FROM "restaurant_reviews" WHERE "restaurant_reviews"."restaurant_id" = ?  [["restaurant_id", 1]]